package cafe;

// Створення потоків і використання Thread states, використання інтерфейсу Runnable.
// Обробити помилки, що можуть виникати під час виконання.
// Варіант 5
// Кав'ярня
// Створіть програму, де кілька клієнтів (потоки) приходять до кав'ярні та роблять замовлення на каву.
// Один потік (бариста) відповідає за приготування кави.
// Використовуйте семафори, щоб обмежити кількість замовлень, що одночасно готуються
// (наприклад, 2 замовлення одночасно).
// Враховуйте робочі години: коли кав’ярня зачинена, ніхто не може увійти, лише працівник піти додому.
public class Main {
    public static void main(String[] args) {
        System.out.println("Hello World");
    }
}
